# ---------------------------------------------------------#
# list ว่าง
number = []
# ---------------------------------------------------------#

# ---------------------------------------------------------#
# สมาชิกใน list 1,2,3,4,5,6,7,8,9
number = [1, 2, 3, 4, 5, 6, 7, 8, 9]
# ---------------------------------------------------------#

# ---------------------------------------------------------#
# สมาชิกใน list Watcharapol,Fa,Yotadee
name = ["Watcharapol", "Fa", "Yotadee"]
# ---------------------------------------------------------#

#---------------------------------------------------------#
# สมาชิกใน list 19, "นาย", False, 3.14, -1
all = [19, "นาย", False, 3.14, -1]
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# construtor
age = list([15, 19])
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# เข้าถึงข้อมูลใน list (ทีละตัว)แบบค่าบวก 0 1 2 3
print(age[0])
print("# ------------------ line 31 ------------------#")
# ---------------------------------------------------------#

# ---------------------------------------------------------#
# เข้าถึงข้อมูลใน list (ทีละตัว)แบบค่าลบ -1 -2 -3
print(age[-1])
print("# ------------------ line 37 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# เข้าถึงข้อมูลใน list (ทีละหลายตัว)แบบค่าบวก
print(all[0:4])  # ตั้งแต่ 0  ก่อนถึง 4 (ตำแหน่งที่เริ่มนับจาก 0)
print("# ------------------ line 44 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# เข้าถึงข้อมูลใน list (ทีละหลายตัว)แบบค่าลบ
print(all[-4:-2])  # ตั้งแต่ -4  ก่อนถึง -2 (ตำแหน่งที่เริ่มนับจาก -1)
print("# ------------------ line 51 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# เข้าถึงข้อมูลใน list (ทีละหลายตัว)แบบไม่กำหนดตัวเริ่มต้น
print(all[1:])  # ตั้งแต่ 1 จนถึงสุดท้าย (ตำแหน่งที่เริ่มนับจาก 1)
print("# ------------------ line 58 ------------------#")
# ---------------------------------------------------------#

# ---------------------------------------------------------#
# การแก้ไขข้อมูลใน list   ชื่อตัวแปร [ตำแหน่ง]=ข้อใหม่
print("ก่อนแก้ไข", number)
number[0:] = 0, 1, 2, 3, 4, 5, 6, 7, 8
print("หลังแก้ไข", number)
print("# ------------------ line 66 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การแสดงผลข้อมูลด้วย Loop
sum = 0
for x in number:
    print("สมาชิกใน list number >> ", x)
    sum += x
print("ผลรวมสมาชิกใน list number == ", sum)
print("# ------------------ line 77 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การตรวจสอบข้อมูล
coffeeshop = list(["Thai tea", "Green tea", "Milo"])
if "Thai tea" in coffeeshop:
    print(coffeeshop[0], " in coffeeshop")
else:
    print(coffeeshop[0], "   not in coffeeshop")
print("# ------------------ line 88 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การนับจำนวนสมาชิกใน list
vocabulary = list(["super talented", "should", "discrimnation"])
print("ข้อมูลใน list vocabulary มีทั้งหมด >> ", len(vocabulary), "  ตัว")
print("# ------------------ line 96 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การเข้าถึงสมาชิกใน list ทั้งหมด
fan = list(["Hatari", "Sharp ", "Tefal"])
for i in range(len(fan)):
    print(fan[i])
print("# ------------------ line 105 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การรวมข้อมูล (+)
fan = list(["Hatari", "Sharp ", "Tefal"])
Airconditioner = list(["Carrier", "Daikin ", "Lg"])
allGroups = Airconditioner + fan
print("การรวมข้อมูล  allGroups >> ", allGroups)
print("# ------------------ line 115 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การรวมข้อมูล (+) extend
fan = list(["Hatari", "Sharp ", "Tefal"])
Airconditioner = list(["Carrier", "Daikin ", "Lg"])
fan.extend(Airconditioner)
print("การรวมข้อมูล  Extend >> ", fan)
print("# ------------------ line 125 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การคัดลอกข้อมูล
fancoppy = []
print("ก่อนลบ Copy >> ", fancoppy)
fancoppy = fan.copy()
print("หลังลบ Copy >> ", fancoppy)
print("# ------------------ line 135 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การเพิ่มข้อมูล โดยใช้ append มันจะเพิ่มโดยการต่อท้าย
print("ก่อนเพิ่มแบบ append >> ", fan)
fan.append("Mitsubishi")
print("หลังเพิ่มแบบ append >> ", fan)
print("# ------------------ line 144 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การเพิ่มข้อมูล โดยใช้ insert (ตำแหน่งที่จะแทรก,ข้อมูล) มันจะเพิ่มโดยการแทรกตำแหน่งได้
print("ก่อนเพิ่มแบบ insert >> ", fan)
fan.insert(0, "Imarflex")
print("หลังเพิ่มแบบ insert >> ", fan)
print("# ------------------ line 153 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การลบข้อมูล โดยใช้ remove เลือกข้อมูล
print("ก่อนลบ remove >> ", fan)
fan.remove("Mitsubishi")
print("หลังลบ remove >> ", fan)
print("# ------------------ line 162 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การลบข้อมูล โดยใช้ pop ลบตัวบนสุดของ list
print("ก่อนลบ pop >> ", fan)
fan.pop()
print("หลังลบ pop >> ", fan)
print("# ------------------ line 171 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การลบข้อมูล โดยใช้ del  เลือกตำแหน่ง[]ในช่่อง
print("ก่อนลบ del >> ", fan)
del fan[1]  # del fan เพื่อ ลบ list ได้เลย
print("หลังลบ del >> ", fan)
print("# ------------------ line 180 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การลบข้อมูล โดยใช้ clear ลบสมาชิกออกทั้งหมดให้เหลือ list ว่าง
print("ก่อนลบ clear >> ", fan)
fan.clear()
print("หลังลบ clear >> ", fan)
print("# ------------------ line 189 ------------------#")
# ---------------------------------------------------------#


# ---------------------------------------------------------#
# การนับข้อมูล โดยใช้ count นับสมาชิกซ้ำว่ามีทั้งหมดที่ตัวใน list
numberr = [1, 1, 1, 1, 2, 2, 2, 23, 35, 5, 4, 5, 6, 2, 1, 5, 6, 3, 7, 8]
print(numberr.count(1))
print("# ------------------ line 197 ------------------#")
# ---------------------------------------------------------#
