# ตัวดำเนินการทางคณิตศาสตร์
'''
ตัวดำเนินการ | ตัวถูกดำเนินการ
Operator | Operand

A+B
A , B == Operand
+ == Operator
'''

z = 5
c = 20
print("ผลบวก == >", z+c)
print("ผลลบ == > ", z-c)
print("ผลคูณ == >", z*c)
print("ผลหาร == >", z/c)
print("หารเอาเศษ == >", z % c)
print("ผลหารตัดเศษลง == >", z//c)
print("ยกกำลัง == >", z**c)

# ตัวดำเนินการเปลียบเทียบ
'''
นำข้อมูลอย่างน้อย 2 ข้อมูล มาเปรียบเทียบกัน
ต้องเป็นข้อมูลประเภทเดียวกัน

คำตอบจะมีแค่ True or false
'''
a, s = 10, 100
print("ค่า a มากกว่า s หรือไม่ ? == >", a > s)
print("ค่า a น้อยกว่า s หรือไม่ ? == >", a < s)
print("ค่า a เท่ากับ s หรือไม่ ? == >", a == s)
print("ค่า a ไม่เท่ากับ s หรือไม่ ? == >", a != s)
print("ค่า a มากกว่าเท่ากับ s หรือไม่ ? == >", a >= s)
print("ค่า a น้อยเท่ากับ s หรือไม่ ? == >", a <= s)
